#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c]
module.frontend.aws_acm_certificate.ssl: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd]
module.frontend.aws_route53_record.example["video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.frontend.aws_route53_record.example["www.video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.frontend.aws_acm_certificate_validation.ssl: Refreshing state... [id=2022-01-23 21:54:35.297 +0000 UTC]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2QZVOHCSCH69J]
module.frontend.aws_route53_record.subdomain_www[0]: Refreshing state... [id=Z1M325FGK1MICN_www.video_A]
module.frontend.aws_route53_record.subdomain_root: Refreshing state... [id=Z1M325FGK1MICN_video_A]
module.frontend.aws_s3_bucket.bucket: Refreshing state... [id=video.rayprogramming.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.frontend.aws_route53_record.example["video.rayprogramming.com"] has changed
  ~ resource "aws_route53_record" "example" {
        id              = "Z1M325FGK1MICN__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME"
        name            = "_03818f016c5687757483524eb672ebaa.video.rayprogramming.com"
        # (6 unchanged attributes hidden)
    }

  # module.frontend.aws_route53_record.example["www.video.rayprogramming.com"] has changed
  ~ resource "aws_route53_record" "example" {
        id              = "Z1M325FGK1MICN__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME"
        name            = "_cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com"
        # (6 unchanged attributes hidden)
    }

  # module.frontend.aws_route53_record.subdomain_root has changed
  ~ resource "aws_route53_record" "subdomain_root" {
        id      = "Z1M325FGK1MICN_video_A"
        name    = "video"
      + records = []
      + ttl     = 0
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.frontend.aws_route53_record.subdomain_www[0] has changed
  ~ resource "aws_route53_record" "subdomain_www" {
        id      = "Z1M325FGK1MICN_www.video_A"
        name    = "www.video"
      + records = []
      + ttl     = 0
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.frontend.aws_s3_bucket.bucket has changed
  ~ resource "aws_s3_bucket" "bucket" {
      + arn                         = "arn:aws:s3:::video.rayprogramming.com"
      + bucket_domain_name          = "video.rayprogramming.com.s3.amazonaws.com"
      + bucket_regional_domain_name = "video.rayprogramming.com.s3.us-east-2.amazonaws.com"
      + hosted_zone_id              = "Z2O1EMRO9K5GLX"
        id                          = "video.rayprogramming.com"
      - policy                      = jsonencode(
            {
              - Id        = "PolicyForCloudFrontPrivateContent"
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2QZVOHCSCH69J"
                        }
                      - Resource  = "arn:aws:s3:::video.rayprogramming.com/*"
                      - Sid       = "1"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> null
      + region                      = "us-east-2"
      + request_payer               = "BucketOwner"
      + tags                        = {}
      + tags_all                    = {}
        # (3 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "arn" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      ~ versioning {
          ~ enabled    = true -> false
            # (1 unchanged attribute hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.frontend.aws_kms_key.mykey will be created
  + resource "aws_kms_key" "mykey" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "This key is used to encrypt bucket objects"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.frontend.aws_s3_bucket.bucket is tainted, so must be replaced
-/+ resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::video.rayprogramming.com" -> (known after apply)
      ~ bucket_domain_name          = "video.rayprogramming.com.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "video.rayprogramming.com.s3.us-east-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2O1EMRO9K5GLX" -> (known after apply)
      ~ id                          = "video.rayprogramming.com" -> (known after apply)
      + policy                      = jsonencode(
            {
              + Id        = "PolicyForCloudFrontPrivateContent"
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E2QZVOHCSCH69J"
                        }
                      + Resource  = "arn:aws:s3:::video.rayprogramming.com/*"
                      + Sid       = "1"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      ~ region                      = "us-east-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (3 unchanged attributes hidden)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = "aws:kms"
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> true
            # (1 unchanged attribute hidden)
        }
    }

  # module.frontend.aws_s3_bucket_object.index will be created
  + resource "aws_s3_bucket_object" "index" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "frontend/../../frontend/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.frontend.aws_s3_bucket_public_access_block.bucket_pab will be created
  + resource "aws_s3_bucket_public_access_block" "bucket_pab" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*